# Завдання 1

name = input("Введіть ваші призвіще ім'я та побатькові: ")
print('Рядок складається з літер: ', 'name'.isalpha())
print('Вітаю, ', name.upper())

# Завдання 2 - введення даних?

print("Введіть п'ять чисел")
a = int(input('Введіть перше число: '))
b = int(input('Введіть друге число: '))
c = int(input('Введіть третє число: '))
d = int(input('Введіть четверте число: '))
e = int(input('Введіть п\'яте число: '))
num = (a, b, c, d, e)
avr = int(sum(num)) / int(len(num))
total = num[1] + num[-2] + avr
print(num[-2])
print(total)

# Завдання 3

print('Давайте створимо параметри для унікального кольору в діапазоні від 0 до 255 для кожного значення')
red = int(input('Введіть значення для червоного: '))
green = int(input('Введіть значення для зеленого: '))
blue = int(input('Введіть значення для синього: '))
rgb = (red, green, blue)
if 0 > red or red > 255:
    print('Неправильно введені дані. Вкажіть значення від 0 до 255')
elif 0 > green or green > 255:
    print('Неправильно введені дані. Вкажіть значення від 0 до 255')
elif 0 > blue or blue > 255:
    print('Неправильно введені дані. Вкажіть значення від 0 до 255')
else:
    print('Параметри кольору в форматі RGB: ', rgb)

# Завдання 4

from collections import namedtuple

marks0 = list(input('insert marks for first student: '))

print(marks0)

Marks = namedtuple('Оцінки', 'Алгебра Геометрія Історія Інформатика Географія')

marks1 = Marks(90, 85, 95, 100, 90)
print("Результати екзаменів Віталія у першому семестрі:", marks1)

marks2 = Marks(75, 50, 55, 75, 80)
print("Результати екзаменів Володимира у першому семестрі:", marks2)

marks3 = Marks(90, 75, 85, 80, 90)
print("Результати екзаменів Юлії у першому семестрі:", marks3)

# Завдання 5

a = int(input('Введіть значення першого числа: '))
b = int(input('Введіть значення  числа: '))
c = int(input('Введіть значення першого числа: '))
my_tuple = (a, b, c)
print(sorted(my_tuple))

# Завдання 6

print('Доброго дня! Нещодавно ви відвідали  курорт "Морська зірка". Сподіваємось, ваше перебування було приємним.')
review = str(input('Будь ласка, залиште ваш відгук: '))
if 'меню' in review:
    print('Відгук містить слово "меню"')
elif 'спортзал' in review:
    print('Відгук містить слово "спортзал"')
elif 'обслуговування' in review:
    print('Відгук містить слово "обслуговування"')
a = int(len(review))
if a > 60:
    print('Вам надається знижка 15% на наступне відвідуванняю. При бронюванні вкажіть код "SeaStar15"')
