# Завдання 1

print('Обчислення суми всіх натуральних чисел від a до b (включно)')
a = int(input('Введіть число а: '))
b = int(input('Введіть число b, більше ніж а: '))
s = 0
for i in range (a, b+1):
     s = s + i
print('Результат: ', s)

# Завдання 2

print('Обчислення факторіалу введеного Вами числа')

x = int(input('Введіть число: '))
f = 1
for i in range (2, x+1):
    f *= i
print('Результат: ', f)


# Завдання 3

for i in range (10):
     for j in range (i + 1):
         print ('*', end= "")
     print("")

# Завдання 4

print('Обчислення суми всіх натуральних чисел від a до b (включно), які є кратними середньому арифметичному проміжку')
a = int(input('Введіть число а: '))
b = int(input('Введіть число b, більше ніж а: '))
avr = int((a+b) / 2)
s = 0
for i in range(a,b+1):
    if i % avr == 0:
        s = s + 1
print('Результат: ', s)

# Завдання 5

print('Виводимо на екран прямокутник з "*"')
a = int(input('Введіть довжину прямокутника: '))
b = int(input('Введіть ширину прямокутника: '))
for i in range (a):
      for j in range (b):
          print ('*', end= "")
      print("")

# Завдання 6

x = 3
while x:
    x -= 1
    response = input('Введіть ваш логін: ')
    if response == "qwerty":
        break
        print('Авторизацію успішно пройдено')
else:
    print('Неправильне введення логіну')
