# Завдання 4

# Створіть магазин канцтоварів використовуючи списки для зберігання елементів. Для додавання елементів створіть
# функцію, яка буде запитувати дані в користувача і зібрані дані у вигляді кортежу додавати у створений список на
# початку. Результат вивести на екран. Під час створення дотримуйтесь правил специфікації PEP 8.

print('МАГАЗИН КАНЦТОВАРІВ')
print('Асортимет:')


def add_stationery(goods, *args):
    """Функція add_stationery додає нові елементи у вигляді кортежу в створений список"""
    return goods, args


stationery = ['ручка кулькова', 'ручка гелева', 'олівець грифельний', 'набір олівців кольорових', 'лінійка', 'маркер']
print(stationery)

new_stationery = input('Введені вами позиції буде додано на полиці магазину: ')
print(add_stationery(stationery, new_stationery))
