# Завдання 2

# Створіть дві функції, що обчислюють значення певних алгебраїчних виразів. На екрані виведіть таблицю значень цих
# функцій від -5 до 5 з кроком 0.5.

def square(a):
    return a**2


def cube(b):
    return b**3


def main():
    xs = (i * 0.5 for i in range(-10, 11))
    for i in xs:
        x = square(i)
        y = cube(i)
        print('Піднесення до квадрату числа (', i, ') = ', x, sep='')
        print('Піднесення до кубу числа (', i, ') = ', y, sep='')


if __name__ == '__main__':
    main()
