# Завдання 4

# Створіть програму, яка складається з функції, яка приймає три числа і повертає їх середнє арифметичне, і головного
# циклу, що запитує у користувача числа і обчислює їх середні значення за допомогою створеної функції.


def avr(a, b, c):
    return (a+b+c) / 3


x = 3
y = 65
z = 7
print('Середнє арифметичне чисел =', avr(x, y, z))

number_1 = float(input('Введіть перше число: ', ))
number_2 = float(input('Введіть друге число: ', ))
number_3 = float(input('Введіть третє число: ', ))
print('Середнє арифметичне ведених вами чисел =', avr(number_1, number_2, number_3))
