# Завдання 5
#
# Створіть програму, яка приймає як формальні параметри зріст і вагу користувача, обчислює індекс маси тіла і в
# залежності від результату повертає інформаційне повідомлення (маса тіла в нормі, недостатня вага або слідкуйте за
# фігурою). Користувач з клавіатури вводить значення росту та маси тіла та передає ці дані у вигляді фактичних
# параметрів під час виклику функції. Програма працює доти, доки користувач не зупинить її комбінацією символів «off».

print('Визначення індексу маси тіла')


def bmi(m, h):
    return m / (h ** 2)


while True:
    print('''
    Щоб порахувати індекс маси тіла та отримати рекомендаціі, введіть ok
    Вихід з меню, введіть off
    ''')
    choice = str(input('Ваш вибір: '))
    if choice == 'off':
        print('Exit')
        break
    if choice == 'ok' or 'Ok':
        my_weight = float(input('Введіть вашу вагу в кілограмах: '))
        my_height = float(input('Введіть ваш зріст в метрах: '))
        print('Ваш індекс маси тіла складає ', bmi(my_weight, my_height))
        y = bmi(my_weight, my_height)
        if y <= 18.5:
            print('''Вага недостатня. Підвищується ризик виникнення таких розладів здоров’я, як аменорея у жінок,
            крихкість кісток, нестача поживних речовин для здорового функціонування усіх систем організму.''')
        elif 24.9 > y > 18.6:
            print('''Ваша вага у нормі. «Ідеальний» ІМТ 22 - 23. Якщо ІМТ наближується до показника 25, почніть 
            контролювати об’єм талії і пам’ятайте про про фізичну активність.''')
        elif 29.9 > y > 25:
            print('''У вас надлишкова вага, що є фактором високого ризику виникнення серцево-судинних захворювань,
        цукрового діабету, порушень статевої функції та інших захворювань. Намагайтеся зменшити вагу, почніть
        правильно харчуватися і займатися спортом.''')
        elif y >= 30:
            print('''У вас велика надмірна вага (ожиріння). Вам треба худнути до більш низьких значень ІМТ, щоб здорово 
            жити. Високий індекс маси тіла пов'язаний з підвищеним ризиком смертності від будь-яких причин, включаючи 
            діабет, хвороби серцево-судинної системи, гіпертонію і артрит.''')
        else:
            print('Введіть коректне значення')

    else:
        print('Введіть коректне значення')
