# Завдання 1

# Дано два рядки. Виведіть на екран символи, які є в обох рядках.

l1 = {9, -2, 45, 76, 23, 8, 1, -5, 93, 24, -47, 85, 6, 90, 35, 72, 0, -16, 84, -91, 25, 12, 5, 38, 7, 115, -4, 5, 8}
l2 = {84, 0, -74, 29, -6, 115, 77, -4, 9, 64, 80, -57, 12, -38, 11, 8, 76, -6, 45, 3, -10, 24, 75, 2, -18, 75, 1, 4}
print('Перший рядок:\n', l1)
print('Другий рядок:\n', l2)
print('Символи, які є в обох рядках:\n', l1 & l2)
