# Завдання 3

# Створіть програму, яка має 2 списки цілочисельних значень та друкує список унікальних значень без повтору,
# які є в 1 списку (немає в другому) і навпаки.

l1 = {9, -2, 45, 76, 23, 8, 1, -5, 93, 24, -47, 85, 6, 90, 35, 72, 0, -16, 84, -91, 25, 12, 5, 38, 7, 115, -4, 5}
l2 = {84, 0, -74, 29, -6, 115, 77, -4, 9, 64, 80, -57, 12, -38, 11, 8, 76, -6, 45, 3, -10, 24, 75, 2, -18, 75, 4}
print('Перший список:\n', l1)
print('Другий список:\n', l2)
print('Cписок унікальних значень першого списку (немає в другому) без повтору\n', l1.difference(l2))
print('Cписок унікальних значень другого списку (немає в першому без повтору)\n', l2.difference(l1))
