# Завдання 5

# Є рядок, в якому зберігаються 1000 слів. Створіть словник із ключами - унікальними словами та значеннями -
# кількістю повторів кожного слова у послідовності.

Tolkien = '''ФЕРМЕР ДЖАЙЛЗ ІЗ ГЕМА

Був собі Еґідіус де Гаммо — чоловік , котрий жив у самісінькому центрі Острова Британія . Повне ім'я його звучало так 
: Еґідіус Агенобарбус Юліус Аґрікола де Гаммо ; адже в ті давно минулі дні , коли цей острів був іще щасливо розділений 
на багато королівств , людей щедро обдаровували іменами . Тоді часу було багато , а мешканців — мало , тож чимало з них 
здобувало визнання . Проте давня пора відійшла в небуття , тож надалі я називатиму чоловіка коротко і просто : був собі 
Фермер Джайлз із Гема , і мав він руду бороду . Гем — то було звичайне село , та в ті дні села були ще горді й незалежні
. Фермер Джайлз мав пса . І звали того пса Ґарм . Собаки повинні вдовольнятися короткими кличками місцевим діалектом , — 
імення книжною латиною належало давати лише найкращим із них . Ґарм же не володів навіть собачою латиною , зате 
послуговувався звичайною мовою ( на таке була здатна більшість псів його часу ) , щоби лякати , вихвалятися чи 
підлещуватися . Лякав він жебраків і непроханих гостей , вихвалявся перед іншими собаками , а підлещувався до власного 
господаря . Ґарм одночасно і пишався Джайлзом , і боявся його , той умів лякати й вихвалятися навіть краще , ніж пес .

У той час не було ні поспіху , ні метушні . Утім , метушня має мало спільного з роботою . Люди працювали й без неї ; 
причому встигали і добряче потрудитись , і потеревенити . А потеревенити було про що , бо непересічні події відбувалися 
вельми часто . Проте , коли розпочалася ця історія , в Гемі вже довгенько не коїлося нічого , вартого згадки . І це 
цілком влаштовувало Фермера Джайлза — неквапливого чолов'ягу , звиклого жити по-своєму та перейматися лише власними 
справами . Він був страшенно заклопотаний ( так принаймні казав ) тим , що убезпечував себе від злиднів , себто 
забезпечував собі такі самі черевце та почуття спокою , які були в його батька . Пес же намагався допомагати господареві
. І жоден із них не посилав бодай найскупішої думки в Широкий Світ поза їхніми полями , селом і найближчою торговицею .

Проте Широкий Світ таки існував . Поблизу ріс густий ліс , а трохи далі на північному заході були Пустельні Пагорби та 
неокреслені узграниччя гірської країни . До того ж , на землі й далі вільно жили собі велетні — грубий і невихований 
народ , який часом завдавав неабияких клопотів . Був , зокрема , один велетень , більший і дурніший , аніж його 
одноплемінники . Мені не вдалося відшукати в історичних хроніках його імені , та це й не так важливо . Велетень був 
просто здоровецький , мав палицю завбільшки з дерево і ступав важкими кроками . Він розсував в'язи , наче високі трави ,
руйнував дороги та нищив сади , бо його велетенські ступні робили в них діри завглибшки з криницю , а коли він 
перечеплювався через хатину , то вона тут-таки зникала з лиця землі . Отаку шкоду велетень чинив усюди , куди тільки 
прямував , бо голова його підносилася високо над дахами будинків , а ноги мусили дбати про себе самі . Він був 
підсліпуватий і глухий . Але , на щастя , жив дуже далеко в Нетрях і не часто навідував заселені людьми терени , а якщо
й навідував , то ненавмисно . 

Велетень мав просторий напівзруйнований дім високо в горах ; однак друзів через те , що був глухий і дурний , а також 
через рідкісність велетнів у нього було обмаль . Він полюбляв гуляти Пустельними Пагорбами та безлюдними краями біля 
підніжжя гір сам-самісінький .

Однієї погожої літньої днини цей велетень вирушив на прогулянку й довго блукав без жодної мети , чинячи в лісах неабияку 
шкоду . Раптом він помітив , що сонце хилиться до заходу та що наближається час вечері ; а потому виявив , що збився на 
манівці й забрів у ту частину країни , якої зовсім не знав . Помилково звернувши праворуч , велетень ішов і йшов , аж 
доки запала ніч . Тоді присів і почекав , поки зійде місяць . А далі знов ішов і йшов у місячному сяйві , наполегливо 
крокуючи , бо палко бажав дістатися додому . Він залишив свій найкращий мідний казанок на вогні й тепер боявся , що в 
казанка згорить дно . Проте гори опинились у велета за спиною , а сам він уже потрапив на територію , яку населяли люди 
. Правду кажучи , він саме наближався до ферми Еґідіуса Агенобарбуса Юліуса Аґріколи , а село те — простацькою мовою — 
називалося Гем . Ніч видалася гарною . Корови були в полі , й пес Фермера Джайлза вийшов із двору та подався на 
прогулянку — на свій страх і ризик . Його вабили місячне світло та кролики . І , звісно ж , він навіть гадки не мав про 
те , що на прогулянку також вийшов і велетень . Інакше пес міг би мати поважну підставу для того , щоби вийти з двору 
без дозволу , а ще поважнішу —  щоби нищечком причаїтися на кухні . Десь близько другої години велетень забрів на поля 
Фермера Джайлза , поруйнував огорожі , потоптав збіжжя , притлумив трави , які чекали , коли їх скосять . За п'ять
 хвилин він завдав більших збитків , аніж королівське полювання за п'ять днів .

Ґарм почув якесь "  тупу - тупу " вздовж річки й перебіг на західний схил невисокого пагорка , на якому стояв дім його 
господаря , — просто аби поглянути , що коїться . Раптом він побачив велетня , котрий саме переступив через річку й 
розтоптав Ґалатею — улюблену фермерову корову , — розчавивши бідолашну тварину на млинець , от як сам фермер міг би 
розчавити таргана .

Ґармові цього вистачило . Він дзявкнув зі страху та прожогом кинувся додому . Цілком забувши , що вийшов із двору без 
дозволу , він прибіг і зчинив лемент попід вікном спальні свого господаря . Відповіді не було довго . Розбудити Фермера 
Джайлза було не вельми легко .

— Ґвалт ! Ґвалт ! Ґвалт ! — волав Ґарм .

Раптом вікно відчинилось і з нього прицільно вилетіла пляшка .

— Ой ! — вискнув пес , за звичкою рвучко відскакуючи вбік . — Ґвалт ! Ґвалт ! Ґвалт !

Назовні визирнула фермерова голова .

— Клятий псяко ! Що це ти виробляєш ? — запитав Джайлз .

— Нічого , — відказав пес .

— Я тобі покажу нічого ! Я з тебе вранці шкуру здеру , коли почую ще бодай звук , — сказав господар , закриваючи вікно .

— Ґвалт ! Ґвалт ! Ґвалт ! — заволав пес .

Джайлзова голова знову з'явилась у вікні .

— Я вб'ю тебе , коли почую ще бодай звук , — повторив господар . — Що на тебе найшло , дурню ?

— Нічого , — відповів пес , — а от на вас дещо найшло .

— Ти про що ? — запитав розлючений Джайлз , якого така відповідь заскочила зненацька .

Ґарм ніколи раніше не дозволяв собі зухвальства .

— На ваших полях велетень , жахливий велетень ; і він іде сюди , — випалив пес . — Ґвалт ! Ґвалт ! Він чавить ваших 
овець . Він наступив на бідолашну Ґалатею , і вона тепер пласка , наче килимок для витирання ніг . Ґвалт ! Ґвалт ! Він 
трощить усі ваші огорожі та нищить усе ваше збіжжя . Ви мусите діяти сміливо і швидко , господарю , бо залишитеся ні з 
чим .'''

list_Tolkien = Tolkien.split()
count_list_Tolkien = {}
for element in list_Tolkien:
    if element in count_list_Tolkien:
        count_list_Tolkien[element] += 1
    else:
        count_list_Tolkien[element] = 1
for key, value in count_list_Tolkien.items():
    print(f'Унікальне слово "{key}" повторюється у тексті: {value}')
